#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-acm.aws_acm_certificate.shunblog-org will be updated in-place
  ~ resource "aws_acm_certificate" "shunblog-org" {
        arn                       = "arn:aws:acm:us-east-1:589845989135:certificate/523ea8e9-ac52-4128-ae5e-a11ad5a000d5"
      + certificate_body          = (known after apply)
        domain_name               = "shunblog.org"
        domain_validation_options = [
            {
                domain_name           = "shunblog.org"
                resource_record_name  = "_a48e71a8f9a4619202c3e1ff2e59bcb1.shunblog.org."
                resource_record_type  = "CNAME"
                resource_record_value = "_ba7597dcc259a41649e00686335bb883.hkvuiqjoua.acm-validations.aws."
            },
            {
                domain_name           = "*.shunblog.org"
                resource_record_name  = "_a48e71a8f9a4619202c3e1ff2e59bcb1.shunblog.org."
                resource_record_type  = "CNAME"
                resource_record_value = "_ba7597dcc259a41649e00686335bb883.hkvuiqjoua.acm-validations.aws."
            },
        ]
        id                        = "arn:aws:acm:us-east-1:589845989135:certificate/523ea8e9-ac52-4128-ae5e-a11ad5a000d5"
      + private_key               = (sensitive value)
        subject_alternative_names = [
            "*.shunblog.org",
        ]
        tags                      = {}
        validation_emails         = []
        validation_method         = "DNS"

        options {
            certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.aws-acm.aws_acm_certificate.shunkakinoki-com will be updated in-place
  ~ resource "aws_acm_certificate" "shunkakinoki-com" {
        arn                       = "arn:aws:acm:us-east-1:589845989135:certificate/ace7c44d-42e7-456e-b05c-5c9895fcf0cd"
      + certificate_body          = (known after apply)
        domain_name               = "shunkakinoki.com"
        domain_validation_options = [
            {
                domain_name           = "shunkakinoki.com"
                resource_record_name  = "_7d70e7567830ded68ef35de5b0f509bd.shunkakinoki.com."
                resource_record_type  = "CNAME"
                resource_record_value = "_33628ef038fed6432842b8398d51f169.tljzshvwok.acm-validations.aws."
            },
            {
                domain_name           = "*.shunkakinoki.com"
                resource_record_name  = "_7d70e7567830ded68ef35de5b0f509bd.shunkakinoki.com."
                resource_record_type  = "CNAME"
                resource_record_value = "_33628ef038fed6432842b8398d51f169.tljzshvwok.acm-validations.aws."
            },
        ]
        id                        = "arn:aws:acm:us-east-1:589845989135:certificate/ace7c44d-42e7-456e-b05c-5c9895fcf0cd"
      + private_key               = (sensitive value)
        subject_alternative_names = [
            "*.shunkakinoki.com",
        ]
        tags                      = {}
        validation_emails         = []
        validation_method         = "DNS"

        options {
            certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.aws-acm.tls_private_key.shunblog-org will be created
  + resource "tls_private_key" "shunblog-org" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # module.aws-acm.tls_private_key.shunkakinoki-com will be created
  + resource "tls_private_key" "shunkakinoki-com" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # module.aws-acm.tls_self_signed_cert.shunblog-org will be created
  + resource "tls_self_signed_cert" "shunblog-org" {
      + allowed_uses          = [
          + "key_encipherment",
          + "digital_signature",
          + "server_auth",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + key_algorithm         = "RSA"
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 24
      + validity_start_time   = (known after apply)

      + subject {
          + common_name  = "shunblog.org"
          + organization = "Shun Kakinoki"
        }
    }

  # module.aws-acm.tls_self_signed_cert.shunkakinoki-com will be created
  + resource "tls_self_signed_cert" "shunkakinoki-com" {
      + allowed_uses          = [
          + "key_encipherment",
          + "digital_signature",
          + "server_auth",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + key_algorithm         = "RSA"
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 24
      + validity_start_time   = (known after apply)

      + subject {
          + common_name  = "shunkakinoki.com"
          + organization = "Shun Kakinoki"
        }
    }

  # module.aws-cloudfront.aws_cloudfront_distribution.shunblog-org will be created
  + resource "aws_cloudfront_distribution" "shunblog-org" {
      + active_trusted_signers         = (known after apply)
      + aliases                        = [
          + "shunblog.org",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 86400
          + max_ttl                = 31536000
          + min_ttl                = 0
          + smooth_streaming       = false
          + target_origin_id       = "S3-shunblog.org"
          + trusted_signers        = []
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + query_string            = true
              + query_string_cache_keys = []

              + cookies {
                  + forward = "all"
                }
            }
        }

      + origin {
          + domain_name = "shunblog.org.s3-website-us-east-1.amazonaws.com"
          + origin_id   = "S3-shunblog.org"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1"
        }
    }

  # module.aws-s3-bucket.data.aws_iam_policy_document.s3_policy-shunblog will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy-shunblog"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.aws-s3-bucket.aws_cloudfront_origin_access_identity.origin_access_identity-shunblog will be created
  + resource "aws_cloudfront_origin_access_identity" "origin_access_identity-shunblog" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "Some comment"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # module.aws-s3-bucket.aws_s3_bucket.shunblog-org will be created
  + resource "aws_s3_bucket" "shunblog-org" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "shunblog.org"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.aws-s3-bucket.aws_s3_bucket_policy.shunblog-org will be created
  + resource "aws_s3_bucket_policy" "shunblog-org" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.aws-cloudfront.module.aws-acm.aws_acm_certificate.shunblog-org will be created
  + resource "aws_acm_certificate" "shunblog-org" {
      + arn                       = (known after apply)
      + certificate_body          = (known after apply)
      + domain_name               = (known after apply)
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + private_key               = (sensitive value)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = (known after apply)
    }

  # module.aws-cloudfront.module.aws-acm.aws_acm_certificate.shunkakinoki-com will be created
  + resource "aws_acm_certificate" "shunkakinoki-com" {
      + arn                       = (known after apply)
      + certificate_body          = (known after apply)
      + domain_name               = (known after apply)
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + private_key               = (sensitive value)
      + subject_alternative_names = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = (known after apply)
    }

  # module.aws-cloudfront.module.aws-acm.tls_private_key.shunblog-org will be created
  + resource "tls_private_key" "shunblog-org" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # module.aws-cloudfront.module.aws-acm.tls_private_key.shunkakinoki-com will be created
  + resource "tls_private_key" "shunkakinoki-com" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # module.aws-cloudfront.module.aws-acm.tls_self_signed_cert.shunblog-org will be created
  + resource "tls_self_signed_cert" "shunblog-org" {
      + allowed_uses          = [
          + "key_encipherment",
          + "digital_signature",
          + "server_auth",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + key_algorithm         = "RSA"
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 24
      + validity_start_time   = (known after apply)

      + subject {
          + common_name  = "shunblog.org"
          + organization = "Shun Kakinoki"
        }
    }

  # module.aws-cloudfront.module.aws-acm.tls_self_signed_cert.shunkakinoki-com will be created
  + resource "tls_self_signed_cert" "shunkakinoki-com" {
      + allowed_uses          = [
          + "key_encipherment",
          + "digital_signature",
          + "server_auth",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + key_algorithm         = "RSA"
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 24
      + validity_start_time   = (known after apply)

      + subject {
          + common_name  = "shunkakinoki.com"
          + organization = "Shun Kakinoki"
        }
    }

Plan: 14 to add, 2 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
